disaster-survival-backend/app/controllers/disasters_controller.rb

    def index
      render :json => Disaster.all
---
SELECT "disasters".* FROM "disasters"

    def show
      disaster = Disaster.find(params[:id])
---
SELECT "disasters".* FROM "disasters" WHERE "disasters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]