disaster-survival-backend/app/controllers/games_controller.rb

  def show
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    game = Game.new(game_params)
    game.save
---
INSERT INTO "games" ("game_name", "score", "health", "turn", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["game_name", "Test 2"], ["score", 1], ["health", 100], ["turn", 1], ["status", true], ["user_id", 1], ["created_at", "2019-11-12 23:44:06.337467"], ["updated_at", "2019-11-12 23:44:06.337467"]]

  def edit
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    game = Game.find(params[:id])

    puts game_params
    game.update(game_params)
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "games" SET "health" = $1, "status" = $2, "updated_at" = $3 WHERE "games"."id" = $4  [["health", -10], ["status", false], ["updated_at", "2019-11-14 09:31:56.080268"], ["id", 3]]

  def destroy
    game = Game.find(params[:id])
    game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 5]]