disaster-survival-backend/app/controllers/hints_controller.rb

    def index
        render :json => Hint.all
---
SELECT "hints".* FROM "hints"