disaster-survival-backend/app/controllers/protections_controller.rb

    def index
        render :json => Protection.all
---
SELECT "protections".* FROM "protections"