disaster-survival-backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render :json => User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "test"], ["created_at", "2019-11-12 23:21:03.017277"], ["updated_at", "2019-11-12 23:21:03.017277"]]
---
  def create
    user = User.new(user_params)
    user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "DanP"], ["updated_at", "2019-11-13 01:12:15.218560"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)